<a href="https://colab.research.google.com/github/Windbladejg7/Notebooks/blob/main/Python_Practice_2_(Pandas)_19_08_2025.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [13]:
import pandas as pd
import numpy as np


data = pd.Series([x for x in range(1, 6)])
data
data.values # Arreglo de valores (Numpy)
data.index # Estructura index de pandas

data[1]

# Se puede especificar cualquier tipo como indice
serie = pd.Series(np.random.randint(1, 20, 5), index = [x for x in "abcde"])
serie

a    16
b     6
c     7
d     5
e     3
dtype: int64

In [20]:
# Una serie es un diccionario
dictionary = pd.Series({1: "Sondra", 2: "Luisa", 3: "Joma", 4: "Leslie", 5: "Angela"})
dictionary

d = pd.Series(
    dict(
        zip(["Sondra", "Luisa", "Joma", "Leslie", "Angela"], [_ for _ in range(1, 6)])
        )
    )
d

Sondra    1
Luisa     2
Joma      3
Leslie    4
Angela    5
dtype: int64

In [23]:
print(d["Luisa"])
d["Luisa":"Leslie"]

2

Luisa     2
Joma      3
Leslie    4
dtype: int64

In [42]:
df = pd.DataFrame({"a": [x for x in range(1, 6)], "b": [x for x in range(6, 11)]}) # Se le puede pasar un index y un colums
df.columns
df.index

d[d % 2 == 0]
d[["Luisa", "Leslie", "Angela"]]

d.loc["Sondra"] # Usar índice explicito
d.iloc[0] # Usar índice implicito

df.b
df["c"] = df.a + df.b
df.c
df.loc[1:3, "c"] # Primero fila, luego columnas

1     9
2    11
3    13
Name: c, dtype: int64

0    14
1    18
2    22
3    26
4    30
dtype: int64